/*

1.아래의 메모리 그림을 그리시오.

2차원 배열int[][] arr = new int[3][3]

2. 아래를 프로그래밍 하시오.(화폐 매수)

돈을 입력하세요
12900
오만원 : 0장
만원 : 1장
오천원 : 0장
천원 : 2장
오백원 : 1개
백원 : 4개
계속 Y :: 중단 N

3. 가위바위보 게임 

아래를 프로그래밍 하시오.
==============================================
가위 바위 보를 입력하세요.
가위
나는:가위 당신은:가위
비겼습니다
계속 Y :: 중단 N
y
가위 바위 보를 입력하세요.
보
나는:가위 당신은:보
제가 졌습니다.
계속 Y :: 중단 N
n
안녕히 가세요

4. 아래를 프로그래밍 하시오.

다음 코드와 같이 과목과 점수가 짝을 이루도록 2개의 배열을 작성하라.

String course[] = {"Java", "C++", "HTML5", "컴퓨터구조", "안드로이드"};
int score[]  = {95, 88, 76, 62, 55};
그리고 다음 예시와 같이 과목 이름을 입력받아 점수를 출력하는 프로그램을 작성하라. "그만"을 입력받으면 종료한다. (Java는 인덱스 0에 있으므로 score[0]을 출력)

과목 이름 >> Jaba
없는 과목입니다.
과목 이름 >> Java
Java의 점수는 95
과목 이름 >> 안드로이드
안드로이드의 점수는 55
과목 이름 >> 그만

5. 업앤다운 UP&Down 숫자맞추기 게임

컴퓨터가 1~100 숫자(정수 범위) 중 하나를 랜덤으로 정합니다. (이를 알려주지 않습니다.)
사용자는 이 숫자를 맞추어야 합니다.
입력한 숫자보다 정답이 크면 → "UP" 출력,
입력한 숫자보다 정답이 작으면 → "DOWN" 출력.
정답을 맞추면 → "정답"을 출력하고, 지금까지 숫자를 입력한 횟수를 알려줍니다.

(예시)
컴퓨터가 1~100 중 랜덤 숫자 하나를 정합니다.
이 숫자를 맞춰주세요.
1~100 숫자 입력:50
DOWN
1~100 숫자 입력:25
UP
1~100 숫자 입력:38
DOWN
1~100 숫자 입력:32
UP
1~100 숫자 입력:35
UP
1~100 숫자 입력:37
DOWN
1~100 숫자 입력:36
정답입니다! 7회 만에 맞췄어요.

*/

