
//05/09
/*
1. 추상 클래스에 대하여 설명하시오.
  - 추상클래스란 추상메서드를 포함하고있는 클래스를 말한다.
  
2. interface  에서 default  에 대하여 설명하시오.
  - interface에서 디폴트값은 class는 추상클래스(abstract)이고 멤버변수는public static이다.

3. 추상클래스와 interface 의 차이는?
  - 추상클래스는 멤버변수 추상함수 일반 함수 생성자등이 사용가는하고 interface는 추상함수와 변수밖에 올수없다.
	추상 클래스는 단일 상속만하는하며 extends를 이용해 상속할수있다. 인터페이스는 다중상속이 가능하고 implements를 이용한다.

4. 마커 인터페이스에 대하여 설명하시오.
  - 마커인터페이스는 변수와 추상함수 모두 없는 인터페이스를 말한다.

5. 아래에서 포트 번호의 의미는?
www.naver.com:80/team/gugu
  - naver.com 서버에있는 80번 프로그램을 의미한다.


 * */

